## Fatiar (slice) Strings

https://pandas.pydata.org/docs/reference/api/pandas.Series.str.slice.html

In [1]:
import pandas as pd

#### Fatiar string python

In [2]:
# lembrando como fatiar string no python
a = 'pyladies pandas'

In [4]:
a[1:4]

'yla'

In [5]:
a[2::2]

'lde ads'

In [6]:
a[1:-2]

'yladies pand'

In [7]:
a[::-1]

'sadnap seidalyp'

atenção!

no python a contagem começa por zero "0"

intervalo fechado no início e aberto no final, ou seja, inclui o valor inicial e não inclui o valor final do intervado

#### Fatiar strings de uma coluna de um DataFrame Pandas


#### Para usar qualquer método de manipulação de string no pandas, precisamos usar o "Accessor" (acessador) str antes do método

In [9]:
df = pd.DataFrame({
    'nome':['Joana Silva', 'andreA saNtos', 'LeIla BarbOsa'],
    'data_nascimento':['01/04/2001', '05/06/1996', '15/10/1987'],
    'sexo':['feminino', '  feminino', ' feminino  '],
    'cpf':['093.434.324-16', '125.789.674-64', '154.849.764-64']
})
df

            nome data_nascimento         sexo             cpf
0    Joana Silva      01/04/2001     feminino  093.434.324-16
1  andreA saNtos      05/06/1996     feminino  125.789.674-64
2  LeIla BarbOsa      15/10/1987   feminino    154.849.764-64

#### Utilizando a sintaxe para fatiar strings de uma coluna (series)

In [11]:
df['data_nascimento'].str[3:5]

0    04
1    06
2    10
Name: data_nascimento, dtype: object

In [14]:
df['mês_nascimento'] = df['data_nascimento'].str[3:5]
df

            nome data_nascimento         sexo             cpf mês_nascimento
0    Joana Silva      01/04/2001     feminino  093.434.324-16             04
1  andreA saNtos      05/06/1996     feminino  125.789.674-64             06
2  LeIla BarbOsa      15/10/1987   feminino    154.849.764-64             10

#### Utilizando o método str.slice() para fatiar strings de uma coluna (series)

In [15]:
df['ano'] = df['data_nascimento'].str.slice(start=6, stop=None, step=1)
df

,nome,data_nascimento,sexo,cpf,mês_nascimento,ano
0,Joana Silva,01/04/2001,feminino,093.434.324-16,04,2001
1,andreA saNtos,05/06/1996,feminino,125.789.674-64,06,1996
2,LeIla BarbOsa,15/10/1987,feminino,154.849.764-64,10,1987

In [16]:
df['data_nascimento'].str.slice(6,None,1)

0    2001
1    1996
2    1987
Name: data_nascimento, dtype: object